
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.app_insights_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      ~ id                      = "https://probate-aat.vault.azure.net/secrets/app-insights-connection-string-dmt/07bd8775f0bc494d8ef6cb6441d3b399" -> (known after apply)
      ~ name                    = "app-insights-connection-string-dmt" -> "app-insights-connection-string" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-aat/providers/Microsoft.KeyVault/vaults/probate-aat/secrets/app-insights-connection-string-dmt/versions/07bd8775f0bc494d8ef6cb6441d3b399" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-aat/providers/Microsoft.KeyVault/vaults/probate-aat/secrets/app-insights-connection-string-dmt" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "07bd8775f0bc494d8ef6cb6441d3b399" -> (known after apply)
      ~ versionless_id          = "https://probate-aat.vault.azure.net/secrets/app-insights-connection-string-dmt" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "probate-cron-ccd-data-migration-tool-appinsights-aat" -> "f88a43b8-3b46-4d2f-b36c-a788d69c954e"
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-cron-ccd-data-migration-tool-aat/providers/Microsoft.Insights/components/probate-cron-ccd-data-migration-tool-appinsights-aat"
        name                                  = "probate-cron-ccd-data-migration-tool-appinsights-aat"
        tags                                  = {
            "application"         = "probate"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/probate-ccd-data-migration-tool.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#probate"
            "environment"         = "staging"
            "managedBy"           = "Probate"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->